Catalogs/НастройкиЗагрузкиМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиЗагрузкиМероприятий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСтолбец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтолбец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКомментарий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТипМероприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтолбца</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиЗагрузкиМероприятий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектыУчета = Справочники.НастройкиЗагрузкиМероприятий
		.ДоступныеОбъектыУчета();
	
	Для каждого ВидУчета Из ОбъектыУчета Цикл
	
		Элементы.ОбъектУчета.СписокВыбора.Добавить(
			ВидУчета
		);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипМероприятияПриИзменении(Элемент)
	ТипМероприятияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипМероприятияПриИзмененииНаСервере()
	Объект.РезультатПоУмолчанию = Справочники.РезультатыМероприятий.ПустаяСсылка();
	Объект.ДополнительныеРеквизиты.Очистить();
	//Элементы.РезультатПоУмолчанию.СписокВыбора.Очистить();
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	РезультатыМероприятий.Ссылка
	//                      |ИЗ
	//                      |	Справочник.РезультатыМероприятий КАК РезультатыМероприятий
	//                      |ГДЕ
	//                      |	РезультатыМероприятий.Владелец = &Владелец
	//                      |	И РезультатыМероприятий.ПометкаУдаления = ЛОЖЬ");
	//Запрос.УстановитьПараметр("Владелец", Объект.ТипМероприятия);
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Элементы.РезультатПоУмолчанию.СписокВыбора.Добавить(Результат.Ссылка);	
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоУмолчаниюПриИзменении(Элемент)
	РезультатПоУмолчаниюПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезультатПоУмолчаниюПриИзмененииНаСервере()
	Объект.ДополнительныеРеквизиты.Очистить();
	Объект.ДополнительныеРеквизиты.Загрузить(Объект.РезультатПоУмолчанию.ДополнительныеРеквизиты.Выгрузить());
КонецПроцедуры
